ЧартерEDT.Расширение1/src/Catalogs/чартер_Рейсы/чартер_Рейсы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>чартер_Рейсы</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ДатаРейса</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоМест</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьКвотаНаОрганизацию</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МаршрутПерелета</name>
    <type>
      <types>CatalogRef.чартер_МаршрутыПерелета</types>
    </type>
  </attributes>
  <attributes>
    <name>ПродолжительностьПолета</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипВС</name>
    <type>
      <types>EnumRef.чартер_ТипВСРассадка</types>
    </type>
  </attributes>
  <attributes>
    <name>Архив</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДвДанные</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ПаспортРейсаЗагружен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Тема</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Расширение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОбновления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>БортСформирован</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Багаж</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Квотирование</name>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.чартер_Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>КвотаНаРейс</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ЧартерEDT.Расширение1/src/Documents/чартер_ЗаписьНаРейс/чартер_ЗаписьНаРейс.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>чартер_ЗаписьНаРейс</name>
  <registerRecords>InformationRegister.чартер_ЗаписьНаРейс</registerRecords>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.чартер_Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.чартер_Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Рейс</name>
    <type>
      <types>CatalogRef.чартер_Рейсы</types>
    </type>
  </attributes>
  <attributes>
    <name>ТабельныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФИО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФИОАнглийское</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПричиныВылета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>SLIP</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерТелефона</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКакойНОТеЗаявлены</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Исполнитель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусНаРейсе</name>
    <type>
      <types>EnumRef.чартер_СтатусыНаРейсе</types>
    </type>
  </attributes>
  <attributes>
    <name>Место</name>
    <type>
      <types>CatalogRef.чартер_ПосадочныеМестаНаРейс</types>
    </type>
  </attributes>
  <attributes>
    <name>СКемПосадить</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительныйБагаж</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Document>

ЧартерEDT.Расширение1/src/Catalogs/чартер_Рейсы/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// проверить в принципе наличие квот на данный рейс (возврат если совсем без квот)
// сравнить список организаций записанных на рейс и наличие на них квот (вывести организации по которым нет квоты)
// 
// Параметры:
//  Рейс - СправочникСсылка - ПроверяемыйРейс
// 
// Возвращаемое значение:
//  Булево - Квотирование на рейс заполнено
Функция КвотированиеНаРейсЗаполнено(Рейс) Экспорт
	
	ЕстьОшибки = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	чартер_РейсыКвотирование.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.чартер_Рейсы.Квотирование КАК чартер_РейсыКвотирование
	               |ГДЕ
	               |	чартер_РейсыКвотирование.Ссылка = &Рейс";
	
	Запрос.УстановитьПараметр("Рейс", Рейс);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда		
		СообщениеПользователю = СтрШаблон("Для построения отчета необходимо 
									|заполнить квоты для организаций на рейс %1!", Рейс);
		чартеры_ОбщиеПроцедурыИФункцииСервер.СообщитьПользователю(СообщениеПользователю);				
		ЕстьОшибки = Истина;
		Возврат ЕстьОшибки;                                    	
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	чартер_ЗаписьНаРейс.Организация КАК Организация
	               |ПОМЕСТИТЬ втОрганизацииЗаписанныеНаРейс
	               |ИЗ
	               |	Документ.чартер_ЗаписьНаРейс КАК чартер_ЗаписьНаРейс
	               |ГДЕ
	               |	чартер_ЗаписьНаРейс.Рейс = &Рейс
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	чартер_ЗаписьНаРейс.Организация
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Организация
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	чартер_РейсыКвотирование.Организация КАК Организация
	               |ПОМЕСТИТЬ втКвотыДляОрганизацийНаРейс
	               |ИЗ
	               |	Справочник.чартер_Рейсы.Квотирование КАК чартер_РейсыКвотирование
	               |ГДЕ
	               |	чартер_РейсыКвотирование.Ссылка = &Рейс
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	чартер_РейсыКвотирование.Организация
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Организация
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	втКвотыДляОрганизацийНаРейс.Организация.Представление КАК КвотыОрганизации,
	               |	втОрганизацииЗаписанныеНаРейс.Организация.Представление КАК ЗарегистрированнаяОрганизация
	               |ИЗ
	               |	втОрганизацииЗаписанныеНаРейс КАК втОрганизацииЗаписанныеНаРейс
	               |		ЛЕВОЕ СОЕДИНЕНИЕ втКвотыДляОрганизацийНаРейс КАК втКвотыДляОрганизацийНаРейс
	               |		ПО втОрганизацииЗаписанныеНаРейс.Организация = втКвотыДляОрганизацийНаРейс.Организация";
	
	Запрос.УстановитьПараметр("Рейс", Рейс);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.КвотыОрганизации = Null Тогда
			Сообщение = СтрШаблон("Нет квоты для организации %1! Отчет будет не корректен"
													, Выборка.ЗарегистрированнаяОрганизация); 
			чартеры_ОбщиеПроцедурыИФункцииСервер.СообщитьПользователю(Сообщение);
			Продолжить;
		КонецЕсли;
	КонецЦикла;
    
	Возврат ЕстьОшибки;
	
КонецФункции

// Получить компоновку рейса.
// 
// Параметры:
//  Рейс - СправочникСсылка - ПроверяемыйРейс 
// Рейс
// 
// Возвращаемое значение:
//  Неопределено - Получить компоновку рейса
Функция ПолучитьКомпоновкуРейса(Рейс) Экспорт
	
	Результат = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	чартер_Рейсы.ТипВС КАК ТипВС
	               |ИЗ
	               |	Справочник.чартер_Рейсы КАК чартер_Рейсы
	               |ГДЕ
	               |	чартер_Рейсы.Ссылка = &Рейс";
	
	Запрос.УстановитьПараметр("Рейс", Рейс);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Результат = Неопределено;	
	Иначе
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Результат = Выборка.ТипВС;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Доступность рейса.
// 
// Параметры:
//  Рейс - СправочникСсылка - ПроверяемыйРейс
// 
// Возвращаемое значение:
//  Булево - Доступность рейса в справочнике
Функция ДоступностьРейса(Рейс) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	чартер_Рейсы.Архив КАК Архив
	               |ИЗ
	               |	Справочник.чартер_Рейсы КАК чартер_Рейсы
	               |ГДЕ
	               |	чартер_Рейсы.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Рейс);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Выборка.Следующий();
	Если НЕ Выборка.Архив = Неопределено Тогда
		Возврат ?(Выборка.Архив, Ложь, Истина);
	Иначе 
		Возврат Выборка.Архив;
	КонецЕсли;
				
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
    СтандартнаяОбработка = Ложь;
    
    Поля.Добавить("Наименование");
    Поля.Добавить("ДатаРейса");
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;    
    Представление = СтрШаблон("%1 дата рейса: %2", Данные.Description, Формат(Данные.ДатаРейса, "ДЛФ=Д"));
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
